{
  "Projects": [
    {
      "id": 1,
      "projectName": "Flim Flix",
      "Description": "FlimFlix is an impressive movie web application designed to enhance your entertainment experience. Users can easily watch movies and trailers on FlimFlix. With just a click, dive into the world of cinema. Keep track of movies and TV series you want to watch later by adding them to your personalized watchlist. Search for movies, TV series, or cast members using our advanced and stylish search input. The search functionality is both powerful and user-friendly.",
      "image": "https://i.ibb.co/VwMTXJw/Flim-Flix.png",
      "Technologies": [
        "Reactjs",
        "Javascript",
        "TailwindCSS",
        "React-Redux",
        "Redux-Toolkit",
        "RTK-Query",
        "Material UI"
      ],
      "Links": {
        "github": "Search for movies, TV series, or cast members using our advanced and stylish search input. The search functionality is both powerful and user-friendly.",
        "live": "https://flimflix-dev.netlify.app/"
      }
    },
    {
      "id": 2,
      "projectName": "Memoro (Personal Growth App)",
      "Description": "Memoro is a comprehensive personal growth and management app that brings together note-taking, to-do lists, reminders, health tracking, and money management in a single platform. The app helps users organize tasks, track habits, monitor health, and manage finances in one unified, intuitive interface.",
      "image": "https://i.ibb.co.com/F4rzrRtD/memoro.png",
      "Technologies": [
        "Javascript",
        "TypeScript",
        "NextJs",
        "TailwindCSS",
        "Shadcn UI",
        "IndexedDB"
      ],
      "Links": {
        "github": "https://github.com/TanjimulSabbir/Memoro",
        "live": "http://localhost:5173/"
      }
    },
    {
      "id": 3,
      "projectName": "Organic BD (E-Commerce Platform)",
      "Description": "Developed and optimized a full-featured e-commerce platform focusing on product catalog, search, cart, and checkout workflows. Implemented robust form handling and validation using React Hook Form and Zod for accurate customer data entry, ensuring a smooth and secure shopping experience.",
      "image": "https://i.ibb.co.com/Ngmz6cbC/organicbd.png",
      "Technologies": [
        "Reactjs",
        "Javascript",
        "TypeScript",
        "TailwindCSS",
        "React Hook Form",
        "Zod",
        "Nodejs",
        "Expressjs",
        "MongoDB"
      ],
      "Links": {
        "github": "",
        "live": "https://organicbd.net"
      },
      "stack": "Full-stack / E-Commerce App"
    },
    {
      "id": 5,
      "projectName": "Drake Porfolio",
      "Description": "This is a portfolio website designed to enhance my skills in design. The site incorporates various features, including two types of navigation bars. Users have the flexibility to adjust the background color and text color to suit their preferences for a more comfortable experience. I aim to provide a dynamic user experience through this site.",
      "image": "https://i.ibb.co/9rdwrcJ/drake-portfolio-cut.png",
      "Technologies": ["HTML", "CSS", "TailwindCSS", "Javascript"],
      "Links": {
        "github": "https://github.com/TanjimulSabbir/Darke-Portfolio",
        "live": "https://drake-portfolio.netlify.app/"
      },
      "stack": "Front-end and Design"
    },
    {
      "id": 6,
      "projectName": "Tic-Tac-Toe",
      "Description": "Tic-Tac-Toe holds a special place in my personal interests. One day, I stumbled upon this game on social media and felt inspired to create it myself. I kept it simple, using just vanilla JavaScript. If time permits, I plan to implement a 'play against the computer' feature in the future. Additionally, I've included sound effects for wins and losses, aiming to provide users with a more vibrant gaming experience. Enjoy the game!",
      "image": "https://i.ibb.co/gFBbjqs/Tic-Tac-Toe.png",
      "Technologies": ["HTML", "CSS", "TailwindCSS", "Javascript"],
      "Links": {
        "github": "https://github.com/TanjimulSabbir/Tic-Tac-Toe",
        "live": "https://tanjimulsabbir.github.io/Tic-Tac-Toe/"
      },
      "stack": "Front-end and Design"
    }
  ]
}
